Repository: Centaurioun/mkdocs-mdpo-plugin
Catalog: docs/*/extensions-support.md.po
Languages: es

source: Extensions support
es: Soporte de extensiones

source: *[HTML]: Hyper Text Markup Language
es: *[HTML]: Lenguaje de Marcado de Hipertexto

source: *[W3C]: World Wide Web Consortium
es: *[W3C]: Consorcio Mundial de Internet

source: You must always let one newline between each reference:
es: Siempre debes dejar una línea en blanco entre cada referencia:

source: [Officially supported extensions](https://python-markdown.github.io/extensions/#officially-supported-extensions)
es: [Extensiones soportadas oficialmente](https://python-markdown.github.io/extensions/#officially-supported-extensions)

source: You must always include a [`<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) HTML comment before the admonition.
es: Debes incluir siempre un comentario HTML [`<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) antes de la advertencia.

source: Code blocks are not translated by default, but you can include a [`<!-- mdpo-include-codeblock -->`](https://mdpo.readthedocs.io/en/master/commands.html#extracting-code-blocks) HTML comment before each code block that you want translate.
es: Los bloques de código no son traducidos por defecto, pero puedes incluir un comentario HTML [`<!-- mdpo-include-codeblock -->`](https://mdpo.readthedocs.io/en/master/commands.html#extracting-code-blocks) antes de cada bloque de código que quieres traducir.

source: You must always let one newline between each footnote content:
es: Siempre debes dejar una línea en blanco entre cada contenido de nota al pie:

source: [^1]: This is a footnote content.
es: [^1]: Este es un contenido de nota al pie.

source: [^2]: This is another footnote content.
es: [^2]: Este es otro contenido de nota al pie.

source: The plugin aims to provide basic support (at least) for the most used extensions. Unfortunately, sometimes you must customize the messages extraction process using HTML comments to exclude certain syntaxes that depends on extensions, or change a bit the format of your Markdown files.
es: El plugin trata de proveer soporte básico (al menos) para las extensiones más usadas. Desafortunadamente, a veces debes personalizar el proceso de extracción de mensajes usando comentarios HTML para excluir ciertas sintaxis dependiente de las extensiones, o cambiar un poco el formato de tus archivos Markdown.

source: Permanent link
es: Link permanente

source: Jump back to footnote 1 in the text
es: Volver a la nota al pie 1 en el texto

source: Jump back to footnote 2 in the text
es: Volver a la nota al pie 2 en el texto

source: [PyMdown extensions](https://facelessuser.github.io/pymdown-extensions/extensions)
es: [Extensiones PyMdown](https://facelessuser.github.io/pymdown-extensions/extensions)

source: There is no way of skip inline codespan blocks from being included in translations:
es: No hay forma de ignorar bloques de código en línea de ser incluidos en las traducciones:

source: Sometimes the translation should edit links. See the next example linking to this documentation depending on the current language:
es: A veces la traducción debe editar enlaces. Observa el siguiente ejemplo enlazando a esta documentación dependiendo del idioma actual:

source: You must let one blank line between each progress bar.
es: Debes dejar una línea en blanco entre cada barra de progreso.

source: Block notation is not supported. You must add an [`<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) HTML comment before the line.
es: La notación en bloque no está soportada. Debes añadir un comentario HTML [`<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) antes de la línea.

source: You must add an [`<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) HTML comment before each tab.
es: Debes añadir un comentario HTML [`<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) antes de cada pestaña.

source: Text can't be added between tasklist items.
es: No se puede añadir texto entre elementos de listas de tareas.

source: Output
es: Salida

source: The HTML specification is maintained by the W3C.
es: La especificación HTML es mantenida por la W3C.

source: Admonition title
es: Título de advertencia

source: Note
es: Nota

source: Even the implicit title, which in this case would be "Note".
es: Incluso el título implícito, el cual en este caso sería "Nota".

source: The title will also be included in the PO file.
es: El título también será añadido en el archivo PO.

source: Apple
es: Manzana

source: Pomaceous fruit of plants of the genus Malus in the family Rosaceae.
es: Fruto de orujo de plantas del género Malus de la familia Rosaceae.

source: Orange
es: Naranja

source: The fruit of an evergreen tree of the genus Citrus.
es: El fruto de un árbol de hoja perenne del género Citrus.

source: This is a footnote[^1]. This is another[^2].
es: Esto es una nota al pie[^1]. Esto es otra[^2].

source: First header
es: Primer encabezado

source: Second header
es: Segundo encabezado

source: Content cell
es: Contenido de celda

source: PO file content
es: Contenido de archivo PO

source: [link](https://mondeja.github.io/mkdocs-mdpo-plugin){: title="With a translated title!" mdpo-notitle }
es: [link](https://mondeja.github.io/mkdocs-mdpo-plugin){: title="¡Con un título traducido!" mdpo-notitle }

source: Hello, I'm text with ^^an insert^^.
es: Hola, soy texto con ^^un insert^^.

source: Hello, I'm text with^a\ superscript^
es: Hola, soy texto con^un\ sobreíndice^

source: Open styled details
es: Detalles con estilo abierto

source: Nested details!
es: Detalles anidados!

source: And more content again.
es: Y más contenido de nuevo.

source: I :heart: mdpo
es: Me encanta mdpo :heart:

source: Here is some code: `#!py3 import pymdownx; pymdownx.__version__`.
es: Aquí hay algo de código: `#!py3 import pymdownx; pymdownx.__version__`.

source: The mock shebang will be treated like text here: ` #!js var test = 0; `.
es: El shebang simulado se tratará como texto aquí: ` #!js var test = 0; `.

source: You can access to the mdocs-mdpo-plugin documentation here: https://mondeja.github.io/mkdocs-mdpo-plugin
es: Puedes acceder a la documentación de mkdocs-mdpo-plugin aquí: https://mondeja.github.io/mkdocs-mdpo-plugin/es

source: ==mark me==
es: ==marcame==

source: Here are some symbols: (tm) (c) (r)
es: Aquí hay algunos símbolos: (tm) (c) (r)

source: Tab content
es: Contenido de pestaña

source: ~~Delete me~~
es: ~~Elimíname~~

source: If an extension is not listed here, just means that is not tested, not that doesn't works. If you doubt if using an extension the messages can be translated correctly, it is better to try it directly.
es: Si una extensión no está listada aquí, simplemente significa que no ha sido probada, no que no funcione. Si dudas si usando una extensión los mensajes pueden ser traducidos correctamente, es mejor probarlo directamente.

source: Only `title` attributes values are translated. Currently, this extension is a bit tricky because, if you want to see the `title` attribute value included in your PO file, you must add an attribute `mdpo-notitle`:
es: Sólo los valores de los atributos `title` son traducidos. Actualmente, esta extensión es un poco complicada porque, si quieres ver el valor del atributo `title` incluído en un archivo PO, debes añadir un atributo `mdpo-notitle`:

source: If after adding a details admonition, a msgid starting with `???` is added to your PO file, you can remove it adding a [`<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) HTML comment before the admonition.
es: Si tras añadir una advertencia de detalles, un msgid empezando con `???` es añadido a tu archivo PO, puedes eliminarlo añadiendo un comentario HTML [`\<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) antes de la advertencia.

source: If you [submit a pull request](https://github.com/mondeja/mkdocs-mdpo-plugin/pulls) adding tests evidencing that a extension works, it would be added here.
es: Si [envías un pull request](https://github.com/mondeja/mkdocs-mdpo-plugin/pulls) añadiendo tests evidenciando que una extensión funciona, será añadida aquí.

source: Block notation is not supported. You must add an [`\<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) HTML comment before the line.
es: La notación en bloque no está soportada. Debes añadir un comentario HTML [`\<!-- mdpo-disable-next-line -->`](https://mdpo.readthedocs.io/en/master/commands.html#disabling-extraction) antes de la línea.

source: Warning
es: Precaución

source: Some content of certain extensions placed inside tabs will not be translated.
es: Cierto contenido de algunas extensiones colocadas dentro de etiquetas no será traducido.

source: Some inserted content from another file.
es: Algo de contenido insertado desde otro archivo.
